class AboutController < ApplicationController
  def index
    @faqs = [
      {
        question: "Ποιός είναι ο σκοπός του AthensBus.info;",
        answer: "Ο στόχος του AthensBus.info είναι να συμβάλλει στην καλύτερη λειτουργία των λεωφορείων της Αθήνας. Είναι κάπως κλισέ, αλλά ισχύει: για να βελτιώσουμε κάτι πρέπει πρώτα να το μετρήσουμε. Ελλείψει κάποιου άλλου εργαλείου, το AthensBus.info χρησιμοποιεί τα δημόσια δεδομένα της τηλεματικής για καταγράψει πόσα δρομολόγια γίνονται κάθε μέρα, σε κάθε λεωφορειακή γραμμή της Αθήνας. Ελπίζω ότι η ύπαρξη του AthensBus.info θα αυξήσει την παρατηρησιμότητα της λειτουργίας των λεωφορείων της Αθήνας, αναδεικνύοντας προβλήματα που υπάρχουν σε διάφορες γραμμές. Αν αυτές οι δυσλειτουργίες γίνουν ορατές σε ανθρώπους που μπορούν να επηρεάσουν τη λειτουργία των λεωφορείων, θα βελτιωθεί η καθημερινότητα πολλών ανθρώπων."
      },
      {
        question: "Από πού προέρχονται τα δεδομένα που βλέπω;",
        answer: "Το AthensBus.info χρησιμοποιεί το δημόσιο API της <a href='http://telematics.oasa.gr'>τηλεματικής</a> του ΟΑΣΑ για τα δεδομένα που δείχνει."
      },
      {
        question: "Σχετίζεται το AthensBus.info με τον ΟΑΣΑ;",
        answer: "Όχι, το AthensBus.info είναι ένα προσωπικό project και δεν σχετίζεται με τον ΟΑΣΑ."
      },
      {
        question: "Πόσο ακριβές το περιεχόμενο του AthensBus.info;",
        answer: "Το AthensBus.info βασίζεται στην τηλεματική του ΟΑΣΑ και στα δημόσια δεδομένα της. Οι υποδομές πάνω στις οποίες λειτουργεί, κατά καιρούς αποτυγχάνουν, προκαλώντας κενά στα δεδομένα. Επίσης, κάποιοι υπολογισμοί, όπως ο υπολογισμός των εκτελεσμένων δρομολογίων είναι κατά προσέγγιση. Συνεπώς, το περιεχόμενο του AthensBus.info δίνεται χωρίς εγγυήσεις αξιοπιστίας."
      },
      {
        question: "Πόσο παλιά δεδομένα κρατάει το AthensBus.info;",
        answer: "Για λόγους πόρων (πχ χώρος στο δίσκο, ταχύτητα), το AthensBus.info κρατάει δεδομένα μέχρι 30 μέρες στο παρελθόν. Αυτό σημαίνει ότι δε μπορείτε να βρείτε τα δρομολόγια για μια γραμμή λεωφορείου σε μια ημερομηνία 2 μήνες πριν. Το χρονικό όριο ενδέχεται να αλλάξει, αλλά σε κάθε περίπτωση θα υπάρχει κάποιο όριο."
      },
      {
        question: "Με τι είναι φτιαγμένο το AthensBus.info;",
        answer: "Το AthensBus.info είναι ένα <a href='https://rubyonrails.org/'>Rails</a> application. Η βάση που χρησιμοποιεί είναι η <a href='https://www.postgresql.org/'>PostgreSQL</a> 17. Είναι deployed σε ένα server της <a href='https://www.hetzner.com/'>Hetzner</a> με το <a href='https://kamal-deploy.org/'>Kamal</a>."
      },
      {
        question: "Ποιός έφτιαξε το AthensBus.info;",
        answer: "Γειά και χαρά, με λένε <a href='https://www.linkedin.com/in/fragkakis/'>Μάρκο Φραγκάκη</a>."
      },
      {
        question: "Πώς προέκυψε η ιδέα;",
        answer: "Παλιότερα ήμουν καθημερινός χρήστης των λεωφορείων. Για να γυρίσω από τη δουλειά, έπαιρνα το Μετρό μέχρι το σταθμό Χαλάνδρι, και από εκεί το λεωφορείο για το σπίτι. Το λεωφορείο μου ξεκίναγε από αφετηρία, οπότε θεωρητικά ήξερα από τα αναρτημένα προγράμματα την ώρα που θα ξεκινήσει. Έτσι, φρόντιζα να φύγω συγκεκριμένη ώρα από τη δουλειά, ώστε βγω από το Μετρό 5 λεπτά πριν το δρομολόγιο του λεωφορείου. Δυστυχώς, το δρομολόγιο πολλές φορές δε γινόταν. Όσες φορές βρήκα σταθμάρχη για να ρωτήσω, έπαιρνα απαντήσεις του τύπου ότι έσκασε το λάστιχο του λεωφορείου, ή ότι έχει κίνηση, ή ότι ο οδηγός αρρώστησε. Όσο περίμενα για να γίνει το επόμενο δρομολόγιο, συμπλήρωνα μια φόρμα παραπόνων που είχε τότε ο ΟΑΣΑ, για τα οποία παράπονα πήρα και κάποιες έγγραφες απαντήσεις. Κάποιες απαντήσεις ήταν ίδιες με αυτές του σταθμάρχη, αλλά κάποια έκανε λόγο για έναν συγκεκριμένο οδηγό της γραμμής, σε βάρος του οποίου κινήθηκε πειθαρχική διαδικασία. Σε κάθε περίπτωση, το πρόβλημα δε διορθώθηκε όσο έπαιρνα το λεωφορείο.<br/><br/>Έτσι προέκυψε η ιδέα για μια εφαρμογή που θα δείχνει πόσα δρομολόγια έγιναν πραγματικά για κάθε γραμμή, και θα αντιπαραβάλει τα πραγματικά δρομολόγια με το πρόγραμμα."
      },
      {
        question: "Επικοινωνία",
        answer: "markos.fragkakis [at] gmail [dot] com"
      },
    ]
  end
end
