class AboutController < ApplicationController
  def index
    @faqs = [
      {
        question: "Τι είναι το AthensBus.info;",
        answer: "Το AthensBus.info είναι ένας ιστότοπος που δείχνει τη λειτουργία των λεωφορείων της Αθήνας. Για κάθε γραμμή της Αθήνας, μπορείτε να δείτε πόσα δρομολόγια ήταν προγραμματισμένα ανά ημέρα, πόσα έγιναν (κατά προσέγγιση), καθώς και τις ώρες που πέρασε το λεωφορείο από κάθε στάση. Επίσης, υπάρχουν διάφορες αναφορές που βασίζονται σε αυτά τα δεδομένα."
      },
      {
        question: "Ποιός είναι ο σκοπός του AthensBus.info;",
        answer: <<~ANSWER
          Ο μοναδικός στόχος του AthensBus.info είναι να συμβάλλει στην καλύτερη λειτουργία των λεωφορείων της Αθήνας. Είναι κάπως κλισέ, αλλά ισχύει: για να βελτιώσουμε κάτι πρέπει πρώτα να το μετρήσουμε. Ελλείψει κάποιου άλλου εργαλείου, το AthensBus.info χρησιμοποιεί τα δημόσια δεδομένα της τηλεματικής για καταγράψει πόσα δρομολόγια γίνονται κάθε μέρα, σε κάθε λεωφορειακή γραμμή της Αθήνας.
          <br/><br/>
          Στόχοι του AthensBus.info <strong>δεν</strong> είναι:
          <br/><br/>
          <ul>
          <li>Να "μειώσει" τον ΟΑΣΑ ή το έργο του</li>
          <li>Να "μειώσει" την πολιτική ηγεσία ή το έργο της</li>
          <li>Να κάνει (ή να γίνει εργαλείο για να γίνει) αντιπολίτευση στην εκάστοτε κυβέρνηση</li>
          <li>Να πει σε κάποιον πως δεν κάνει καλά τη δουλειά του</li>
          </ul>
          <br/>
          Ελπίζω ότι η ύπαρξη του AthensBus.info θα αυξήσει την παρατηρησιμότητα της λειτουργίας των λεωφορείων της Αθήνας, αναδεικνύοντας προβλήματα που υπάρχουν σε διάφορες γραμμές. Αν αυτές οι δυσλειτουργίες γίνουν ορατές σε ανθρώπους που μπορούν να επηρεάσουν τη λειτουργία των λεωφορείων, θα βελτιωθεί η καθημερινότητα πολλών επιβατών.
        ANSWER
      },
      {
        question: "Από πού προέρχονται τα δεδομένα που βλέπω;",
        answer: "Το AthensBus.info χρησιμοποιεί το δημόσιο API της <a href='http://telematics.oasa.gr'>τηλεματικής</a> του ΟΑΣΑ για τα δεδομένα που δείχνει."
      },
      {
        question: "Σχετίζεται το AthensBus.info με τον ΟΑΣΑ;",
        answer: "Όχι, το AthensBus.info είναι ένα προσωπικό project και δεν σχετίζεται με τον ΟΑΣΑ."
      },
      {
        question: "Πόσο ακριβές το περιεχόμενο του AthensBus.info;",
        answer: "Το AthensBus.info βασίζεται στην τηλεματική του ΟΑΣΑ και στα δημόσια δεδομένα της. Οι υποδομές πάνω στις οποίες λειτουργεί, κατά καιρούς αποτυγχάνουν, προκαλώντας κενά στα δεδομένα. Επίσης, κάποιοι υπολογισμοί, όπως ο υπολογισμός των εκτελεσμένων δρομολογίων είναι κατά προσέγγιση. Συνεπώς, το περιεχόμενο του AthensBus.info δίνεται χωρίς εγγυήσεις αξιοπιστίας."
      },
      {
        question: "Γιατί σε αρκετά μέρη βλέπω 'κατά προσέγγιση';",
        answer: <<~ANSWER
          Ενώ το AthensBus.info παίρνει τα δεδομένα της τηλεματικής, δεν είναι πάντα εύκολο να ξέρουμε πόσα δρομολόγια έγιναν. Παραδείγματα δυσκολιών:<br/><br/>
            <ul>
            <li>Το API της τηλεματικής ενίοτε δε λειτουργεί για κάποια λεπτά, το οποίο μπορεί να 'σπάσει' ένα δρομολόγιο σε δύο ημιτελή δρομολόγια, τα οποία ο αλγόριθμος του AthensBus.info να μετρήσει σαν δύο.</li>
            <li>Ενίοτε το API της τηλεματικής δηλώνει το δρομολόγιο κάποιου λεωφορείου με το ID κάποιας παραλλαγής μιας γραμμής, η οποία έχει διαφορετικό προγραμμα δρομολογίων (πχ 1 την ημέρα). Αυτό δείχνει στο σύστημα ότι έγιναν δεκάδες περισσότερα δρομολόγια των προβλεπομένων.</li> 
            <li>Τα οχήματα φαίνονται σαν αναμενόμενα στις στάσεις μονάχα όταν ξεκινήσουν ένα δρομολόγιο. Το AthensBus.info όμως ελέγχει κάθε στάση κάθε 5 λεπτά. Αυτό έχει σαν συνέπεια οι πρώτες στάσεις να φαίνονται συχνά χωρίς αφίξεις.</li>
            </ul>          
            Έχουν γίνει διάφορες προσπάθειες για να διορθώνονται τα δεδομένα που παρουσιάζονται. Για παράδειγμα, για τον υπολογισμό των εκτελεσμένων δρομολογίων λαμβάνονται υπόψιν οι 'μεσαίες' στάσεις της γραμμής. Θα γίνουν επιπλέον τέτοιες βελτιώσεις, αλλά σε κάθε περίπτωση, τα εκτελεσμένα δρομολόγια θα είναι μια εκτίμηση. 
        ANSWER
      },
      {
        question: "Πότε καταλαβαίνω ότι τα δεδομένα που βλέπω είναι προβληματικά;",
        answer: <<~ANSWER
           <strong>Οι πρώτες στάσεις δεν δείχνουν αφίξεις</strong>
           <p>Στο παρακάτω γράφημα φαίνονται τα δρομολόγια μιας γραμμής για μια συγκεκριμένη ημέρα. Παρατηρήστε ότι οι πρώτες στάσεις (αριστερά) δεν έχουν σχεδόν καθόλου αφίξεις, ενώ οι μεσαίες και τελευταίες στάσεις έχουν πολλές.</p>
           #{ActionController::Base.helpers.image_tag('about/first_stops_no_arrivals.png', alt: 'Παράδειγμα: Οι πρώτες στάσεις δεν δείχνουν αφίξεις', class: 'img-fluid', style: 'max-width: 100%; height: auto; border: 1px solid #ddd; border-radius: 8px; margin: 20px 0;')}

           <strong>Διακοπές στη λειτουργία του API της τηλεματικής</strong>
           <p>Όταν το API της τηλεματικής σταματά να λειτουργεί για κάποιο χρονικό διάστημα, τα δρομολόγια φαίνονται σπασμένα. Στο παρακάτω γράφημα, παρατηρήστε τις διακοπές στις γραμμές των δρομολογίων, όπου υπάρχουν κενά λόγω της απουσίας δεδομένων από το API.</p>
           #{ActionController::Base.helpers.image_tag('about/intermittent_arrivals.png', alt: 'Παράδειγμα: Διακοπές στη λειτουργία του API', class: 'img-fluid', style: 'max-width: 100%; height: auto; border: 1px solid #ddd; border-radius: 8px; margin: 20px 0;')}
        ANSWER
      },
      {
        question: "Πόσο παλιά δεδομένα κρατάει το AthensBus.info;",
        answer: "Για λόγους πόρων (πχ χώρος στο δίσκο, ταχύτητα), το AthensBus.info κρατάει δεδομένα μέχρι 30 μέρες στο παρελθόν. Αυτό σημαίνει ότι δε μπορείτε να βρείτε τα δρομολόγια για μια γραμμή λεωφορείου σε μια ημερομηνία 2 μήνες πριν. Το χρονικό όριο ενδέχεται να αλλάξει, αλλά σε κάθε περίπτωση θα υπάρχει κάποιο όριο."
      },
      {
        question: "Με τι είναι φτιαγμένο το AthensBus.info;",
        answer: "Το AthensBus.info είναι ένα <a href='https://rubyonrails.org/'>Rails</a> application. Η βάση που χρησιμοποιεί είναι η <a href='https://www.postgresql.org/'>PostgreSQL</a> 17. Είναι deployed σε ένα server της <a href='https://www.hetzner.com/'>Hetzner</a> με το <a href='https://kamal-deploy.org/'>Kamal</a>."
      },
      {
        question: "Ποιός έφτιαξε το AthensBus.info;",
        answer: "Γειά και χαρά, με λένε <a href='https://www.linkedin.com/in/fragkakis/'>Μάρκο Φραγκάκη</a>."
      },
      {
        question: "Πώς προέκυψε η ιδέα;",
        answer: "Παλιότερα ήμουν καθημερινός επιβάτης των λεωφορείων. Για να γυρίσω από τη δουλειά, έπαιρνα το Μετρό μέχρι το σταθμό Χαλάνδρι, και από εκεί το λεωφορείο για το σπίτι. Ο σταθμός του Μετρό στο Χαλάνδρι είναι και αφετηρία για τα λεωφορεία, οπότε θεωρητικά ήξερα από τα αναρτημένα προγράμματα την ώρα που θα ξεκινήσει. Έτσι, φρόντιζα να φύγω συγκεκριμένη ώρα από τη δουλειά, ώστε βγω από το Μετρό 5 λεπτά πριν το δρομολόγιο του λεωφορείου. Δυστυχώς, το δρομολόγιο πολλές φορές δε γινόταν. Όσες φορές βρήκα σταθμάρχη για να ρωτήσω, οι απαντήσεις ήταν είτε ότι έσκασε το λάστιχο του λεωφορείου, ή ότι έχει κίνηση, ή ότι ο οδηγός αρρώστησε. Όσο περίμενα για να γίνει το επόμενο δρομολόγιο, συμπλήρωνα μια φόρμα παραπόνων που είχε τότε ο ΟΑΣΑ, για τα οποία παράπονα πήρα και κάποιες έγγραφες απαντήσεις. Οι περισσότερες ήταν ίδιες με αυτές του σταθμάρχη, αλλά κάποια έκανε λόγο για έναν συγκεκριμένο οδηγό της γραμμής, σε βάρος του οποίου κινήθηκε πειθαρχική διαδικασία. Σε κάθε περίπτωση, το πρόβλημα δε διορθώθηκε όσο έπαιρνα το λεωφορείο.<br/><br/>Έτσι προέκυψε η ιδέα για μια εφαρμογή που θα δείχνει πόσα δρομολόγια έγιναν πραγματικά για κάθε γραμμή, και θα αντιπαραβάλλει τα πραγματικά δρομολόγια με το πρόγραμμα."
      },
      {
        question: "Επικοινωνία",
        answer: "markos.fragkakis [at] gmail [dot] com"
      },
    ]
  end
end
