class AboutController < ApplicationController
  def index
    @faqs = [
      {
        question: "Ποιός είναι ο σκοπός του AthensBus.info;",
        answer: "Ο στόχος του AthensBus.info είναι να συμβάλλει στην καλύτερη λειτουργία των λεωφορείων της Αθήνας. Είναι κάπως κλισέ, αλλά ισχύει: για να βελτιώσουμε κάτι πρέπει πρώτα να το μετρήσουμε. Ελλείψει κάποιου άλλου εργαλείου, το AthensBus.info χρησιμοποιεί τα δημόσια δεδομένα της τηλεματικής για καταγράψει πόσα δρομολόγια γίνονται κάθε μέρα, σε κάθε λεωφορειακή γραμμή της Αθήνας. Ελπίζω ότι η ανάδειξη αυτής της πληροφορίας θα φτάσει στους ανθρώπους που μπορούν να επηρεάσουν τη λειτουργία των λεωφορείων της Αθήνας, βελτιώνοντας την καθημερινότητα πολλών ανθρώπων."
      },
      {
        question: "Από πού προέρχονται τα δεδομένα που βλέπω;",
        answer: "Το AthensBus.info χρησιμοποιεί το δημόσιο API της <a href='http://telematics.oasa.gr'>τηλεματικής</a> του ΟΑΣΑ για τα δεδομένα που δείχνει."
      },
      {
        question: "Σχετίζεται το AthensBus.info με τον ΟΑΣΑ;",
        answer: "Όχι, το AthensBus.info είναι ένα προσωπικό project και δεν σχετίζεται με τον ΟΑΣΑ."
      },
      {
        question: "Πόσο ακριβές το περιεχόμενο του AthensBus.info;",
        answer: "Το AthensBus.info βασίζεται στα δημόσια δεδομένα της τηλεματικής του ΟΑΣΑ, και τις υποδομές που τη λειτουργούν, οι οποίες κατά καιρούς αποτυγχάνουν, προκαλώντας κενά στα δεδομένα. Επίσης, ο υπολογισμός των πραγματοποιηθέντων δρομολογίων είναι κατά προσέγγιση. Συνεπώς, το περιεχόμενο του AthensBus.info δίνεται χωρίς εγγυήσεις αξιοπιστίας."
      },
      {
        question: "Πόσο παλιά δεδομένα κρατάει το AthensBus.info;",
        answer: "Για λόγους πόρων (πχ χώρος στο δίσκο, ταχύτητα), το AthensBus.info κρατάει δεδομένα μέχρι 30 μέρες στο παρελθόν. Αυτή σημαίνει ότι δε μπορείτε να βρείτε τα δρομολόγια για μια γραμμή λεωφορείου σε μια ημερομηνία 2 μήνες πριν. Το χρονικό όριο ενδέχεται να αλλάξει, αλλά σε κάθε περίπτωση θα υπάρχει κάποιο όριο."
      },
      {
        question: "Με τι είναι φτιαγμένο το AthensBus.info;",
        answer: "Το AthensBus.info είναι ένα <a href='https://rubyonrails.org/'>Rails</a> application. Η βάση που χρησιμοποιεί είναι η <a href='https://www.postgresql.org/'>PostgreSQL</a> 17. Είναι deployed σε ένα server της <a href='https://www.hetzner.com/'>Hetzner</a> με το <a href='https://kamal-deploy.org/'>Kamal</a>."
      },
      {
        question: "Ποιός έφτιαξε το AthensBus.info;",
        answer: "Γειά και χαρά, με λένε <a href='https://www.linkedin.com/in/fragkakis/'>Μάρκο Φραγκάκη</a>."
      },
      {
        question: "Επικοινωνία",
        answer: "markos.fragkakis [at] gmail [dot] com"
      },
    ]
  end
end
